tutorials/cem_toyARC/fluid-openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     	cemFluidFlowFoam;

startFrom       	latestTime;

startTime       	0;

stopAt          	endTime;

endTime         	2;

deltaT          	2.5e-07;

writeControl    	adjustableRunTime;

writeInterval   	0.001;

purgeWrite      	0;

writeFormat     	ascii;

writePrecision  	12;

writeCompression 	off;

timeFormat      	general;

timePrecision   	6;

runTimeModifiable 	true;

adjustTimeStep  	yes;

maxCo			0.1;

maxDeltaT		1e-03;

functions
{
    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }
}
