tutorials/cem_toyARC/fluid-openfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       13700;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       13720;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       13740;
    }
    intf_outer
    {
        type            wall;
        inGroups        1(wall);
        nFaces          360;
        startFace       13780;
    }
    intf_outer1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          320;
        startFace       14140;
    }
    intf_inner
    {
        type            wall;
        inGroups        1(wall);
        nFaces          320;
        startFace       14460;
    }
    intf_inner1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          320;
        startFace       14780;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          14400;
        startFace       15100;
    }
)

// ************************************************************************* //
