tutorials/cem_toyARC/fluid-openfoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 -1 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
	value		uniform (0 -1 0);
    }
    outlet
    {
	type		zeroGradient;
    }
    walls
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }
    "intf.*"
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }
    frontAndBack
    {
        type           	empty;
    }
}
