tutorials/cem_toyARC/fluid-openfoam/0/B
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -2 0 0 -1 0];

internalField   uniform (0 0 1);

boundaryField
{
    "(inlet|outlet|walls|intf.*)"
    {
        type            zeroGradient;
    }
    frontAndBack
    {
	type		empty;
    }
}

// ************************************************************************* //
