tutorials/cem_toyARC/fluid-openfoam/0/JouleHeating
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      JouleHeating;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(inlet|outlet|walls|intf.*)"
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
