tutorials/cem_toyARC/fluid-openfoam/0/UxB
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      UxB;
}

dimensions      [ 1 1 -3 0 0 -1 0 ];

internalField   uniform (-1 0 0);

boundaryField
{
    "(inlet|outlet|walls|intf.*)"
    {
        type            calculated;
	value		$internalField;
    }
    frontAndBack
    {
        type            empty;
    }
}
