tutorials/cem_toyARC/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (CEM);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh-Centers;
    locations         faceCenters;
    connectivity      false;
    patches           (intf_inner intf_inner1 intf_outer intf_outer1);
    
    readData
    (
    );
    
    writeData
    (
	Current
    );
  };
  
  Interface2
  {
    mesh              Fluid-Mesh-Nodes;
    locations         faceNodes;
    connectivity      true;
    patches           (intf_inner intf_inner1 intf_outer intf_outer1);
    
    readData
    (
	Potential
    );
    
    writeData
    (
    );
  };
};

CEM
{
   k   [ 1  1 -3 -1 0 0 0 ] 100;
   solverType "basic";
};
